liftstats-backend/app/controllers/workouts_controller.rb

    def index

        workouts = Workout.where("user_id = '1'").order("created_at DESC").limit(5)
---
SELECT "workouts".* FROM "workouts" WHERE (user_id = '1') ORDER BY created_at DESC LIMIT ?  [["LIMIT", 5]]

    def show

        workout = Workout.find_by(id: params["id"])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def create
        workout = Workout.new
        workout.user_id = params["user_id"]
        workout.workout_type = params["workout"]["workoutType"]
        workout.weight = params["workout"]["weight"]
        workout.reps = params["workout"]["reps"]

        workout = Workout.personal_record(workout)

        if workout.save
---
INSERT INTO "workouts" ("user_id", "workout_type", "weight", "reps", "created_at", "updated_at", "personal_record") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["workout_type", "db fly"], ["weight", 25], ["reps", 12], ["created_at", "2020-08-22 20:19:47.180069"], ["updated_at", "2020-08-22 20:19:47.180069"], ["personal_record", 1]]