liftstats-backend/app/controllers/workouts_controller.rb

    def create
        workout = Workout.new
        workout.user_id = params["user_id"]
        workout.workout_type = params["workout"]["workoutType"]
        workout.weight = params["workout"]["weight"]
        workout.reps = params["workout"]["reps"]

        most_weight = Workout.highest_weight(workout.workout_type)[0]
        most_reps = Workout.most_reps(workout.workout_type)[0]
        most_weight_given_reps = Workout.most_weight_given_reps(workout.workout_type, workout.reps)[0]

        if !most_weight
            most_weight = {weight: 0}
        end
        if !most_reps
            most_reps = {reps: 0}
        end
        if !most_weight_given_reps
            most_weight_given_reps = {weight: 0}
        end

        if workout.weight > most_weight[:weight]
            workout.personal_record = true
        elsif workout.reps > most_reps[:reps]
            workout.personal_record = true
        elsif workout.weight > most_weight_given_reps[:weight]
            workout.personal_record = true
        end

        if workout.save
---
INSERT INTO "workouts" ("user_id", "workout_type", "weight", "reps", "created_at", "updated_at", "personal_record") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["workout_type", "lat pull down"], ["weight", 135], ["reps", 8], ["created_at", "2020-08-09 19:12:12.598553"], ["updated_at", "2020-08-09 19:12:12.598553"], ["personal_record", 1]]