liftstats-backend/app/models/workout.rb

SELECT DISTINCT "workouts"."workout_type" FROM "workouts" WHERE (user_id = '1') ORDER BY workout_type
---
    def self.my_workout_types(user_id=1)
       Workout.where("user_id = '#{user_id}'").order("workout_type").distinct.pluck(:workout_type)

SELECT "workouts".* FROM "workouts" WHERE (user_id = '1' and workout_type = 'bicep curl') ORDER BY weight DESC LIMIT ?  [["LIMIT", 1]]
---
    def self.all_sets(workout_type)
        Workout.where("user_id = '1' and workout_type = '#{workout_type}'")